hubertciebiada/VdMot_Controller/software_stm32/src/motor.cpp
static int undercurrcnt = 0;
static int overcurrcnt = 0;

// drives the valve PSU and motor enable outputs to their inactive level;
// called right after reset, before the 3 s boot window
void valve_pins_safe () {
  // preset the output latch first: switching to open drain with the reset value LOW
  // would enable the valve PSU for a moment
  set_GPIO_Port_Clock(STM_PORT(digitalPinToPinName(POWER_ENA)));
  PSU_OFF();
  pinMode(POWER_ENA, OUTPUT_OPEN_DRAIN);
  PSU_OFF();

  // L293 enable inputs; PA15/PB3 are JTAG pins with pull resistors after reset
  pinMode(CTRL_ENA0, OUTPUT);
  pinMode(CTRL_ENA1, OUTPUT);
  pinMode(CTRL_ENA2, OUTPUT);
  pinMode(CTRL_ENA3, OUTPUT);
  pinMode(CTRL_ENA4, OUTPUT);
  pinMode(CTRL_ENA5, OUTPUT);
  ena_motor(0, 0);
}


// call from setup function in main
byte valve_setup () {

  // valve MUX relay
  pinMode(CTRL_MUX, OUTPUT);

  // L293 enable pins
  pinMode(CTRL_ENA0, OUTPUT);
  pinMode(CTRL_ENA1, OUTPUT);
  pinMode(CTRL_ENA2, OUTPUT);
  pinMode(CTRL_ENA3, OUTPUT);
  pinMode(CTRL_ENA4, OUTPUT);
  pinMode(CTRL_ENA5, OUTPUT);

  // L293 direction pin
  pinMode(CTRL_DIRECTION, OUTPUT); 

  // input for counting revs
  pinMode(REVINPIN, INPUT);

  // external interrupt for counting revs
  //attachInterrupt(digitalPinToInterrupt(REVINPIN),isr_counter,RISING);


 if ((eep_content.currentbound_low_fac>=10) && (eep_content.currentbound_low_fac<=40))
    currentbound_low_fac = eep_content.currentbound_low_fac;
  if ((eep_content.currentbound_high_fac>=10) && (eep_content.currentbound_high_fac<=40))
    currentbound_high_fac = eep_content.currentbound_high_fac;
  if (eep_content.startOnPower<=100) startOnPower=eep_content.startOnPower; else startOnPower=30;
  #ifdef motDebug
    COMM_DBG.print("Current end stop factor low: ");
    COMM_DBG.println((float) (currentbound_low_fac)/10,DEC);
    COMM_DBG.print("Current end stop factor high: ");
    COMM_DBG.println((float) (currentbound_high_fac)/10,DEC);
  #endif

// init valve data
  for (unsigned int x = 0;x<ACTUATOR_COUNT;x++) {
    myvalvemots[x].actual_position = startOnPower;
    myvalvemots[x].target_position = startOnPower;
    myvalvemots[x].meancurrent = 20;       // 20 mA
    myvalvemots[x].scaler = 89;
    myvalvemots[x].calibRetries = 0;
  }

  valvestate = A_INIT;

  // Interval in microsecs
  if (ITimer0.attachInterruptInterval(TIMER0_INTERVAL_MS * 1000, TimerHandler0))
  {
    #ifdef motDebug 
        COMM_DBG.print(F("Starting ITimer0 OK, millis() = ")); COMM_DBG.println(millis());
    #endif
  }
  else {
    #ifdef motDebug
      COMM_DBG.println(F("Can't set ITimer0. Select another freq. or timer"));
    #endif
  }

 

  return 0;
}

void valve_loop () {
  byte temp = 0;
  
  static byte pos_change = 0;

  static unsigned int closing_count = 0;  
  static unsigned int opening_count = 0;
  static int deadzone_count = 0;

  static int idlecurrenttimer = 0;
  
  static unsigned int scaler = 0;
  static int valveindex = 0;

  static int waittimer = 0;
  static int psuofftimer = 0;
  static int locktimer = 0;

  static enum ASTATE oldvalvestate;

  valve_loop_ticks++;

  if(waittimer) waittimer--;

  oldvalvestate = valvestate;

  switch (valvestate) {
    case A_INIT:  
                  if ( motorcycle(0, CMD_M_NOTHING) == M_RES_IDLE ) {                    
                     #ifdef motDebug
                        COMM_DBG.println("A: init ready");
                     #endif
                     valvestate = A_IDLE;
                     
                     //valveindex = 0;                     
                     //myvalves[valveindex].scaler = 130;
                     //myvalves[valveindex].target_position = 0;    

                     valveindex = 255;
                    
                  }
                  break;

    case A_IDLE:  
                  valveindex = valvenr;
                  if (command == CMD_A_OPEN) {
                    #ifdef motDebug                    
                      COMM_DBG.print("A: cmd open for valve ");                  
                      COMM_DBG.println(valveindex, 10);                    
                    #endif
                    valvestate = A_OPEN1;
                    PSU_ON();
                    waittimer = WAIT_TIMER50;
                    psuofftimer = 0;
                    pos_change = poschangecmd;
                  }
                  else if (command == CMD_A_CLOSE) {
                    #ifdef motDebug
                      COMM_DBG.print("A: cmd close for valve ");                  
                      COMM_DBG.println(valveindex, 10);                                        
                    #endif
                    valvestate = A_CLOSE1;  
                    PSU_ON();
                    waittimer = WAIT_TIMER50;
                    psuofftimer = 0;
                    pos_change = poschangecmd;
                  }
                  else if (command == CMD_A_OPEN_END) {  
                    #ifdef motDebug                  
                      COMM_DBG.print("A: cmd open to endstop for valve ");                  
                      COMM_DBG.println(valveindex, 10);                    
                    #endif
                    valvestate = A_OPEN1;
                    PSU_ON();
                    waittimer = WAIT_TIMER50;
                    psuofftimer = 0;
                    pos_change = 255;
                  }
                  else if (command == CMD_A_CLOSE_END) {   
                    #ifdef motDebug                 
                      COMM_DBG.print("A: cmd close to endstop for valve ");                  
                      COMM_DBG.println(valveindex, 10);                    
                    #endif
                    valvestate = A_CLOSE1;
                    PSU_ON();
                    waittimer = WAIT_TIMER50;
                    psuofftimer = 0;
                    pos_change = 255;
                  }
                  else if (command == CMD_A_LEARN) {
                    #ifdef motDebug                    
                      COMM_DBG.print("A: cmd learn for valve ");                  
                      COMM_DBG.println(valveindex, 10);                    
                    #endif
                    valvestate = A_LEARN1;
                    PSU_ON(); 
                    psuofftimer = 0;
                    waittimer = WAIT_TIMER50; 
                    calibRetries = 0;
                    myvalvemots[valveindex].calibRetries=0;
                  }
                  else if (command == CMD_A_TEST) { 
                    #ifdef motDebug                   
                      COMM_DBG.print("A: cmd test valve ");                  
                      COMM_DBG.println(valveindex, 10);  
                    #endif                  
                    valvestate = A_TEST;
                    PSU_ON();
                    waittimer = WAIT_TIMER100;
                    psuofftimer = 0;
                  }
                  else {
                    valvestate = A_IDLE;

                    // switch off PSU after some inactive (idle) time
                    psuofftimer++;
                    if(psuofftimer > 1500) {      // 15 s
                      psuofftimer = 0;
                      PSU_OFF();
                      MUX_OFF();
                    }  
                  }           

                  // decrement learning counter
                  if (!myvalvemots[valveindex].calibration) {
                    if(valvestate == A_OPEN1 || valvestate == A_CLOSE1) {
                      if(myvalves[valveindex].learn_movements) {
                        myvalves[valveindex].learn_movements--;
                      }
                      myvalves[valveindex].movements++;
                    }
                  }

                  // pause temperature measurement to avoid ADC interference
                  if(valvestate != A_IDLE) {
                    temp_command(TEMP_CMD_LOCK);
                    locktimer = 0;
                  }
                  else {
                    if (locktimer<50) locktimer++;
                    else temp_command(TEMP_CMD_UNLOCK);                      
                  }                           

                  command = '\0';       // clear command for next loop call, prevents reevaluating
                  break;

