hubertciebiada/VdMot_Controller/software_stm32/src/motor.cpp
    case A_OPEN1:  // start valve opening
                  if (!waittimer) {
                    if(pos_change==255) isr_target = 65535;
                    else isr_target = myvalvemots[valveindex].scaler * pos_change;
                    m_meancurrent = myvalvemots[valveindex].meancurrent;
                    
                    if (motorcycle (valveindex, CMD_M_OPEN) == M_RES_OPENS) {
                      #ifdef motDebug
                        COMM_DBG.print("A: begin opening by ");                  
                        COMM_DBG.println(pos_change);
                      #endif
                      myvalvemots[valveindex].status = VLV_STATE_OPENING;                                                            
                      valvestate = A_OPEN2;
                      isr_counter=0;
                    }
                    else {
                      #ifdef motDebug
                        COMM_DBG.print("A: cant open valve");                  
                      #endif
                      valvestate = A_IDLE;
                    }
                  }
                  break;
  
    case A_OPEN2:  // wait for finish opening
                  temp = motorcycle (valveindex, 0);
                  if (temp == M_RES_STOP) {
                    #ifdef motDebug
                      COMM_DBG.println("A: opened valve"); 
                    #endif                 
                    valvestate = A_IDLE;
                    myvalvemots[valveindex].actual_position = position_add(myvalvemots[valveindex].actual_position, pos_change);
                    myvalvemots[valveindex].status = VLV_STATE_IDLE; 
                    #ifdef motDebug                   
                      COMM_DBG.print("A: new position "); COMM_DBG.println(myvalvemots[valveindex].actual_position);
                    #endif
                  }
                  else if (temp == M_RES_NOCURRENT) {
                    #ifdef motDebug
                      COMM_DBG.println("A: (A_OPEN2) undercurrent");
                    #endif
                    myvalvemots[valveindex].status = VLV_STATE_OPENCIR;
                    myvalvemots[valveindex].actual_position = myvalvemots[valveindex].target_position;
                    valvestate = A_IDLE;
                    isr_counter=0;
                  } 
                  else if (temp == M_RES_ENDSTOP) {
                    #ifdef motDebug
                      COMM_DBG.println("A: opened valve to end stop");
                    #endif
                    valvestate = A_IDLE;
                    myvalvemots[valveindex].status = VLV_STATE_IDLE;
                    myvalvemots[valveindex].actual_position = 100;
                    #ifdef motDebug
                      COMM_DBG.print("A: new position "); COMM_DBG.println(myvalvemots[valveindex].actual_position);
                    #endif
                  }
                  else if (temp == M_RES_ERROR) {
                    #ifdef motDebug
                      COMM_DBG.println("A: opening valve failed, timeout");
                    #endif
                    valvestate = A_IDLE;
                    myvalvemots[valveindex].status = VLV_STATE_FAILED;
                    myvalvemots[valveindex].actual_position = myvalvemots[valveindex].target_position;
                  }                                     
                  break;

    case A_CLOSE1:  // start valve closing
                  if (!waittimer) {
                    if(pos_change==255) isr_target = 65535;
                    else isr_target = myvalvemots[valveindex].scaler * pos_change;
                    m_meancurrent = myvalvemots[valveindex].meancurrent;
                    
                    if (motorcycle (valveindex, CMD_M_CLOSE) == M_RES_CLOSES) {
                      #ifdef motDebug
                        COMM_DBG.print("A: begin closing by ");                  
                        COMM_DBG.println(pos_change);       
                      #endif
                      myvalvemots[valveindex].status = VLV_STATE_CLOSING;                                                     
                      valvestate = A_CLOSE2;
                      isr_counter=0;
                    }   
                    else {
                      #ifdef motDebug
                        COMM_DBG.print("A: cant close valve");                  
                      #endif
                      valvestate = A_IDLE;
                    }
                  }
                  break;

    case A_CLOSE2:  // wait for finish closing
                  temp = motorcycle (valveindex, 0);
                  if (temp == M_RES_STOP) {
                    #ifdef motDebug
                      COMM_DBG.println("A: closed valve");
                    #endif
                    valvestate = A_IDLE;
                    myvalvemots[valveindex].status = VLV_STATE_IDLE;
                    myvalvemots[valveindex].actual_position = position_sub(myvalvemots[valveindex].actual_position, pos_change);
                    #ifdef motDebug
                      COMM_DBG.print("A: new position "); COMM_DBG.println(myvalvemots[valveindex].actual_position);                   
                    #endif
                  }
                  else if (temp == M_RES_NOCURRENT) {
                    #ifdef motDebug
                      COMM_DBG.println("A: (A_CLOSE2) undercurrent");
                    #endif
                    myvalvemots[valveindex].status = VLV_STATE_OPENCIR;
                    myvalvemots[valveindex].actual_position = myvalvemots[valveindex].target_position;
                    valvestate = A_IDLE;
                    isr_counter=0;
                  } 
                  else if (temp == M_RES_ENDSTOP) {
                    #ifdef motDebug
                      COMM_DBG.println("A: closed valve to end stop");
                    #endif
                    valvestate = A_IDLE;
                    myvalvemots[valveindex].status = VLV_STATE_IDLE;
                    myvalvemots[valveindex].actual_position = 0;
                    #ifdef motDebug
                      COMM_DBG.print("A: new position "); COMM_DBG.println(myvalvemots[valveindex].actual_position);
                    #endif
                  }            
                  else if (temp == M_RES_ERROR) {
                    #ifdef motDebug
                      COMM_DBG.println("A: closing valve failed, timeout");
                    #endif
                    valvestate = A_IDLE;
                    myvalvemots[valveindex].status = VLV_STATE_FAILED;
                    myvalvemots[valveindex].actual_position = myvalvemots[valveindex].target_position;
                  }                   
                  break;                  
    
    case A_LEARN1:  // prepare learning  
                  #ifdef motDebug        
                    COMM_DBG.println("A: try learning valve");                  
                  #endif
                  // first: closing completely
                  undercurrcnt = 0;
                  overcurrcnt = 0;
                  motorcycle (valveindex, CMD_M_CLOSE);
                  myvalvemots[valveindex].status = VLV_STATE_CLOSING;
                  valvestate = A_LEARN2;
                  waittimer = WAIT_TIMER20;
                  m_meancurrent = myvalvemots[valveindex].meancurrent;
                  isr_target = 65535;       // max value to disable stopping
                  break;

    case A_LEARN2:  // goto start position
                  if (!waittimer) {
                    // waiting for closed valve as start position
                    temp = motorcycle (valveindex, 0);
                    if (temp == M_RES_ENDSTOP) {
                      #ifdef motDebug
                        COMM_DBG.println("A: closed valve before learning, now opening");                  
                      #endif
                      // second: opening completely and count rotations
                      isr_counter=0;
                      myvalvemots[valveindex].status = VLV_STATE_OPENING;
                      motorcycle (valveindex, CMD_M_OPEN);
                      isr_target = 65535;       // max value to disable stopping
                      valvestate = A_LEARN3;
                      m_meancurrent = myvalvemots[valveindex].meancurrent;
                      waittimer = WAIT_TIMER20;
                    }
                    else if (temp == M_RES_NOCURRENT) {
                      #ifdef motDebug
                        COMM_DBG.println("A: (A_LEARN2) undercurrent");
                      #endif
                      myvalvemots[valveindex].status = VLV_STATE_OPENCIR;
                      myvalvemots[valveindex].target_position = myvalvemots[valveindex].actual_position;
                      valvestate = A_IDLE;
                      isr_counter=0;
                    }
                    // stop: the counter ran out (isr_target 65535) without an end stop, idle: motor machine not running
                    else if (temp == M_RES_ERROR || temp == M_RES_STOP || temp == M_RES_IDLE) {
                      #ifdef motDebug
                        COMM_DBG.println("A: closing valve failed, timeout");
                      #endif
                      valvestate = A_IDLE;
                      myvalvemots[valveindex].status = VLV_STATE_FAILED;
                      myvalvemots[valveindex].actual_position = myvalvemots[valveindex].target_position;
                    }           
                  }               
                  break;
                  
    case A_LEARN3:  // learning opening way
                  if (!waittimer) {
                    // waiting for opened valve
                    temp = motorcycle (valveindex, 0);
                    if (temp == M_RES_ENDSTOP) {
                      #ifdef motDebug
                        COMM_DBG.println("A: opened valve for learning, now closing again");                  
                      #endif
                      opening_count = isr_counter;   
                      if(m_meancurrent > 0) {
                        myvalvemots[valveindex].meancurrent = m_meancurrent;
                        #ifdef motDebug
                          COMM_DBG.print("A: learned mean current = "); 
                          COMM_DBG.println(myvalvemots[valveindex].meancurrent);
                        #endif
                      }                 
                      // third: closing completely and count rotations
                      isr_counter=0;
                      myvalvemots[valveindex].status = VLV_STATE_CLOSING;
                      motorcycle (valveindex, CMD_M_CLOSE);
                      isr_target = 65535;       // max value to disable stopping
                      m_meancurrent = 20;
                      valvestate = A_LEARN4;
                      waittimer = WAIT_TIMER20;
                    }          
                    else if (temp == M_RES_NOCURRENT) {
                      #ifdef motDebug
                        COMM_DBG.println("A: (A_LEARN3) undercurrent");
                      #endif
                      myvalvemots[valveindex].status = VLV_STATE_OPENCIR;
                      myvalvemots[valveindex].target_position = myvalvemots[valveindex].actual_position;
                      valvestate = A_IDLE;
                      isr_counter=0;
                    }
                    // stop: the counter ran out (isr_target 65535) without an end stop, idle: motor machine not running
                    else if (temp == M_RES_ERROR || temp == M_RES_STOP || temp == M_RES_IDLE) {
                      #ifdef motDebug
                        COMM_DBG.println("A: opening valve failed, timeout");
                      #endif
                      valvestate = A_IDLE;
                      myvalvemots[valveindex].status = VLV_STATE_FAILED;
                      myvalvemots[valveindex].actual_position = myvalvemots[valveindex].target_position;
                    }                
                  }              
                  break;
                  
