hubertciebiada/VdMot_Controller/software_stm32/src/motor.cpp
    case A_LEARN4:  // learning closing way
                  if (!waittimer) {
                    // waiting for closed valve again
                    temp = motorcycle (valveindex, 0);
                    if (temp == M_RES_ENDSTOP) { 
                      #ifdef motDebug 
                        COMM_DBG.println("A: closed valve for learning");                  
                      #endif
                      closing_count = isr_counter;  
                      if(m_meancurrent > 0) {
                        #ifdef motDebug
                          COMM_DBG.print("A: learned mean current = "); 
                          COMM_DBG.println(m_meancurrent);
                        #endif
                        myvalvemots[valveindex].meancurrent = (myvalvemots[valveindex].meancurrent + m_meancurrent) / 2;                      
                      }                      
                                          
                      deadzone_count = (int) closing_count - (int) opening_count;
                      scaler = opening_count / 100;
                      #ifdef motDebug
                        COMM_DBG.print("A: learned closing_count = "); COMM_DBG.println(closing_count);
                        COMM_DBG.print("A: learned opening_count = "); COMM_DBG.println(opening_count);
                        COMM_DBG.print("A: learned deadzone_count = "); COMM_DBG.println(deadzone_count);
                        COMM_DBG.print("A: learned scaler = "); COMM_DBG.println(scaler);
                        COMM_DBG.print("A: learned mean current = "); COMM_DBG.println(myvalvemots[valveindex].meancurrent);
                      #endif
                      myvalvemots[valveindex].closing_count = closing_count;
                      myvalvemots[valveindex].opening_count = opening_count;
                      myvalvemots[valveindex].deadzone_count = deadzone_count;
                      myvalvemots[valveindex].scaler = scaler;
                      myvalvemots[valveindex].actual_position = 0;    // because valve was closed completely  
                      #ifdef motDebug
                        COMM_DBG.print("A: counts = "); COMM_DBG.println(myvalvemots[valveindex].closing_count); 
                        COMM_DBG.println(myvalvemots[valveindex].opening_count);  
                        COMM_DBG.println(noOfMinCounts);                  
                      #endif
                      if ((closing_count<noOfMinCounts) || (opening_count<noOfMinCounts)) 
                      { 
                        calibRetries++;
                        myvalvemots[valveindex].calibRetries++;
                        if (calibRetries>maxCalibRetries)
                          myvalvemots[valveindex].status = VLV_STATE_BLOCKS;
                        else {
                          valvestate = A_LEARN1;
                          PSU_ON(); 
                          psuofftimer = 0;
                          waittimer = WAIT_TIMER50; 
                          #ifdef motDebug
                            COMM_DBG.print("A: calibration retry  = "); COMM_DBG.println(calibRetries); 
                          #endif
                          break;
                        }

                      }
                      else  myvalvemots[valveindex].status = VLV_STATE_IDLE;
                      
                      #ifdef motDebug
                        COMM_DBG.println(myvalvemots[valveindex].status); 
                      #endif
                      /*
                      myvalvemots[valveindex].calibration = false;
                      myvalvemots[valveindex].calibState=calibIdle;
                      valveindex = 255;                                                                                  
                      valvestate = A_IDLE;*/
                      valvestate = A_SET;
                    }    
                    else if (temp == M_RES_NOCURRENT) {
                      #ifdef motDebug
                        COMM_DBG.println("A: (A_LEARN4) undercurrent");
                      #endif
                      myvalvemots[valveindex].status = VLV_STATE_OPENCIR;
                      myvalvemots[valveindex].target_position = myvalvemots[valveindex].actual_position;
                                          
                      valveindex = 255;
                      valvestate = A_IDLE;
                      isr_counter=0;
                    }     
                    // stop: the counter ran out (isr_target 65535) without an end stop, idle: motor machine not running
                    else if (temp == M_RES_ERROR || temp == M_RES_STOP || temp == M_RES_IDLE) {
                      #ifdef motDebug
                        COMM_DBG.println("A: closing valve failed, timeout");
                      #endif
                      valvestate = A_IDLE;
                      myvalvemots[valveindex].status = VLV_STATE_FAILED;
                      myvalvemots[valveindex].actual_position = myvalvemots[valveindex].target_position;
                    }        
                  }           
                  break;

     case A_SET:  // set to previous %
                  valveindex = valvenr;
                  #ifdef motDebug                   
                      COMM_DBG.print("A_SET: set position "); COMM_DBG.println(myvalvemots[valveindex].target_position);
                  #endif
                  myvalvemots[valveindex].actual_position=0;
                  if (myvalvemots[valveindex].target_position==0) {
                      myvalvemots[valveindex].calibration = false;
                      myvalvemots[valveindex].calibState=calibIdle;
                      valveindex = 255;                                                                                  
                      valvestate = A_IDLE;
                  } else {
                    valvestate = A_SET1;
                    PSU_ON();
                    waittimer = WAIT_TIMER50;
                    psuofftimer = 0;
                    pos_change = myvalvemots[valveindex].target_position;
                  }
                  break;

