hubertciebiada/VdMot_Controller/software_stm32/src/motor.cpp
     case A_SET1:  // start valve opening
                  if (!waittimer) {
                    if(pos_change==255) isr_target = 65535;
                    else isr_target = myvalvemots[valveindex].scaler * pos_change;
                    m_meancurrent = myvalvemots[valveindex].meancurrent;
                    
                    if (motorcycle (valveindex, CMD_M_OPEN) == M_RES_OPENS) {
                      #ifdef motDebug
                        COMM_DBG.print("A_SET1: begin opening by ");                  
                        COMM_DBG.println(pos_change);
                      #endif
                      myvalvemots[valveindex].status = VLV_STATE_OPENING;                                                            
                      valvestate = A_SET2;
                      isr_counter=0;
                    }
                    else {
                      #ifdef motDebug
                        COMM_DBG.print("A_SET1: cant open valve");                  
                      #endif
                      valvestate = A_IDLE;
                    }
                  }
                  break;
  
    case A_SET2:  // wait for finish opening
                  temp = motorcycle (valveindex, 0);
                  if (temp == M_RES_STOP) {
                    #ifdef motDebug
                      COMM_DBG.println("A_SET2: opened valve"); 
                    #endif                 
                    myvalvemots[valveindex].actual_position = position_add(myvalvemots[valveindex].actual_position, pos_change);
                    #ifdef motDebug                   
                      COMM_DBG.print("A_SET2: new position "); COMM_DBG.println(myvalvemots[valveindex].actual_position);
                    #endif
                    myvalvemots[valveindex].status = VLV_STATE_IDLE; 
                    myvalvemots[valveindex].calibration = false;
                    myvalvemots[valveindex].calibState=calibIdle;
                    valveindex = 255;                                                                                  
                    valvestate = A_IDLE;
                  }
                  else if (temp == M_RES_NOCURRENT) {
                    #ifdef motDebug
                      COMM_DBG.println("A_SET2: (A_OPEN2) undercurrent");
                    #endif
                    myvalvemots[valveindex].status = VLV_STATE_OPENCIR;
                    myvalvemots[valveindex].actual_position = myvalvemots[valveindex].target_position;
                    myvalvemots[valveindex].calibration = false;
                    myvalvemots[valveindex].calibState=calibIdle;
                    valvestate = A_IDLE;
                    isr_counter=0;
                  } 
                  else if (temp == M_RES_ENDSTOP) {
                    #ifdef motDebug
                      COMM_DBG.println("A_SET2: opened valve to end stop");
                    #endif
                    valvestate = A_IDLE;
                    myvalvemots[valveindex].status = VLV_STATE_IDLE;
                    myvalvemots[valveindex].actual_position = 100;
                    myvalvemots[valveindex].calibration = false;
                    myvalvemots[valveindex].calibState=calibIdle;
                    #ifdef motDebug
                      COMM_DBG.print("A_SET2: new position "); COMM_DBG.println(myvalvemots[valveindex].actual_position);
                    #endif
                  }
                  else if (temp == M_RES_ERROR) {
                    #ifdef motDebug
                      COMM_DBG.println("A_SET2: opening valve failed, timeout");
                    #endif
                    valvestate = A_IDLE;
                    myvalvemots[valveindex].status = VLV_STATE_FAILED;
                    myvalvemots[valveindex].actual_position = myvalvemots[valveindex].target_position;
                    myvalvemots[valveindex].calibration = false;
                    myvalvemots[valveindex].calibState=calibIdle;
                  }                                     
                  break;

     case A_TEST:  // test if a valve is connected                  
                  if (!waittimer) {
                    
                    temp = motorcycle (valveindex, CMD_M_TEST);
                    if (temp != M_RES_TEST) {  
                      #ifdef motDebug
                        COMM_DBG.print("A: (A_TEST) test valve ");
                        COMM_DBG.print(valveindex, DEC);                  
                      #endif
                      if(temp == M_RES_NOCURRENT) {
                        #ifdef motDebug
                          COMM_DBG.println(" --> undercurrent, no valve");
                        #endif
                        myvalvemots[valveindex].status = VLV_STATE_OPENCIR;
                      }
                      else {
                        #ifdef motDebug
                          COMM_DBG.println(" --> valve present");
                        #endif
                        myvalvemots[valveindex].status = VLV_STATE_PRESENT;
                      }

                      valvestate = A_IDLE;                    
                    }
                  }
                  break;

                  
    default:      valvestate = A_IDLE;
                  break;  
  }
  if (valveindex<12) myvalvemots[valveindex].connected= (myvalvemots[valveindex].status != VLV_STATE_OPENCIR);

  // a valve state that never ends stops feeding the watchdog (see loop_system)
  valve_stall.tick((uint8_t) valvestate, valvestate == A_IDLE);
  valve_loop_stalled = valve_stall.stalled();
}


byte motorcycle (int mvalvenr, byte cmd) {
  #define M_INIT      0
  #define M_IDLE      1
  #define M_OPEN      2
  #define M_CLOSE     3
  #define M_TURNING   4
  #define M_TURNON    8
  #define M_STOP      5
  #define M_UNDERCURR 7
  #define M_TESTPREP  9
  #define M_TEST      10
  #define M_SETTLE    11      // wait for the MUX relay after set_motor()
  #define M_START     12      // start motor after M_SETTLE (open/close)
  #define M_TESTSTART 13      // start motor after M_SETTLE (test)

  static byte motorstate = M_INIT;
  static byte settle_next = M_IDLE;
  static byte settle_result = M_RES_TURNING;
  static int settlecnt = 0;
  static int turnoncnt = 0;

  static int cyclecnt = 0;
  static int debouncecnt = 0;
  static int testcnt = 0;
 
