hubertciebiada/VdMot_Controller/software_stm32/src/motor.cpp
  static int normalcurrcnt = 0;

  static unsigned int meancurrent_cnt = 0;      // counts meancurrent values
  static long meancurrent_mem = 0;              // memory for meancurrent values
  byte result = 0;

  // target count reached (flag set by the EXTI handler, which must not run this state machine itself)
  if (isr_stop_request) {
    isr_stop_request = 0;
    if (motorstate == M_TURNON || motorstate == M_TURNING) motorstate = M_STOP;
  }

    switch (motorstate) {
      case M_INIT:  MUX_OFF();         // relay MUX off
                    ena_motor(0, 0);
                    DIR_OFF();         // direction off
  
                    motorstate = M_IDLE;
                    isr_turning = 0;
                    isr_counter = 0;
                    isr_target = 0;
                    result = M_RES_INIT;
                    isr_timer_go = 0;
                    isr_timer_fin = 0;
  
                    break;
  
      case M_IDLE:
                    if (cmd == CMD_M_OPEN) {
                      motorstate = M_OPEN;  
                      result = M_RES_OPENS;
                    }
                    else if (cmd == CMD_M_CLOSE) {
                      motorstate = M_CLOSE;  
                      result = M_RES_CLOSES;
                    }
                    else if (cmd == CMD_M_STOP) {
                      motorstate = M_STOP;
                      result = M_RES_STOP;  
                    }
                    else if (cmd == CMD_M_TEST) {
                      motorstate = M_TESTPREP;
                      result = M_RES_TEST;  
                    }
                    else {
                      motorstate = M_IDLE;  
                      result = M_RES_IDLE;
                    }
  
                    // correct motor nr?
                    if (motorstate != M_IDLE && (mvalvenr < 0 || mvalvenr >= (int) ACTUATOR_COUNT)) {
                      motorstate = M_IDLE;
                      result = M_RES_IDLE;
                    }

                    undercurrcnt = 0;
                    overcurrcnt = 0;
                    
                    break;
      
      case M_OPEN:  
                    #ifdef motDebug
                      COMM_DBG.println("M: state open");                                  
                    #endif
                    set_motor(mvalvenr, DIR_OPEN);
                    settlecnt = MUX_SETTLE_TICKS;
                    settle_next = M_START;
                    settle_result = M_RES_TURNING;
                    motorstate = M_SETTLE;
                    result = M_RES_OPENS;
                    break;
                    
      case M_CLOSE:
                    #ifdef motDebug
                      COMM_DBG.println("M: state close");                                 
                    #endif
                    set_motor(mvalvenr, DIR_CLOSE);
                    settlecnt = MUX_SETTLE_TICKS;
                    settle_next = M_START;
                    settle_result = M_RES_TURNING;
                    motorstate = M_SETTLE;
                    result = M_RES_CLOSES;
                    break;

      case M_SETTLE:
                    if (settlecnt > 0) settlecnt--;
                    if (settlecnt == 0) motorstate = settle_next;
                    result = settle_result;
                    break;

      case M_START:
                    undercurrcnt = 0;
                    overcurrcnt = 0;
                    motorstate = M_TURNON;
                    isr_valvenr = mvalvenr;
                    isr_counter=0;
                    cyclecnt = 0;
                    debouncecnt = 0;
                    isr_stop_request = 0;
                    isr_overcurrentevent = 0;     // may be left over from the previous move
                    isr_timer_go = 0;             // soft start handshake with TimerHandler0 starts from scratch
                    isr_timer_fin = 0;
                    turnoncnt = 0;
                    result = M_RES_TURNING;
                    attachInterrupt(digitalPinToInterrupt(REVINPIN), isr_count, RISING);
                    break;
                  
      case M_TURNON:
                    isr_turning = 1;
                    result = M_RES_TURNING;
                    isr_timer_go = 1;

                    currentbound_low = (int) (m_meancurrent) * -1 * (int) (currentbound_low_fac); //10 * -3;
                    currentbound_high = (int) (m_meancurrent) * (int) (currentbound_high_fac); //10 * 3;

                    meancurrent_mem = 0;
                    meancurrent_cnt = 0;

                    analog_current_old = 0;
                    undercurrcnt = 0;
                    overcurrcnt = 0;
                    normalcurrcnt = 0;

                    // check if pwm is finished
                    if(isr_timer_fin) {
                      motorstate = M_TURNING;
                      isr_timer_fin = 0;
                      isr_timer_go = 0;
                    }
                    // TimerHandler0 (TIM1) did not enable the motor
                    else if (++turnoncnt > TIMEOUT_TURNON) {
                      #ifdef motDebug
                        COMM_DBG.println("M: motor enable timeout");
                      #endif
                      motor_halt();
                      motorstate = M_IDLE;
                      result = M_RES_ERROR;
                    }

                    break;

      case M_TURNING:
                    result = M_RES_TURNING;
    
                    if (cmd == CMD_M_STOP) {
                      motorstate = M_STOP;  
                    }
                    cyclecnt++;
                                
                    if(debouncecnt<255) debouncecnt++;
                    if(testcnt<255) testcnt++;

                    if (debouncecnt > 3) {                      
                      // overcurrent detection
                      if(isr_overcurrentevent)         
                      {                                         
                          motor_halt();
                          motorstate = M_IDLE;
                          result = M_RES_ENDSTOP;
                          isr_overcurrentevent = 0;

                          if (meancurrent_cnt > 0) m_meancurrent = abs(meancurrent_mem) / meancurrent_cnt / 10;
                          else m_meancurrent = 0;
                          #ifdef motDebug
                            COMM_DBG.print("M: Current: "); COMM_DBG.print(current_mA/10,10); COMM_DBG.println(" mA");
                            COMM_DBG.print("M: Cnt:     "); COMM_DBG.println(isr_counter, DEC);                                 
                            COMM_DBG.println("M: Autostop, reached end stop");
                          #endif
                      }

                       // under current detection
                      else if(current_mA < THRESHOLD_UNDERCURRENT && current_mA > -THRESHOLD_UNDERCURRENT) 
                      { 
                        undercurrcnt++;
                        #ifdef motDebug
                            COMM_DBG.print("M: (M_TURNING) under current detection: undercurrcnt="); 
                            COMM_DBG.print(undercurrcnt); 
                            COMM_DBG.print(" current=");
                            COMM_DBG.print(current_mA/10,10); COMM_DBG.println(" mA");
                        #endif
                    
