hubertciebiada/VdMot_Controller/software_stm32/src/motor.cpp
                        if (undercurrcnt > TIMEOUT_UNDERCURRENT)
                        {
                          #ifdef motDebug
                            COMM_DBG.print("M: (M_TURNING) under current detected: undercurrcnt="); 
                            COMM_DBG.print(undercurrcnt); 
                            COMM_DBG.print(" current=");
                            COMM_DBG.print(current_mA/10,10); COMM_DBG.println(" mA. set motorstate to  M_UNDERCURR");
                          #endif
                          undercurrcnt = 0;
                          motorstate = M_UNDERCURR;
                        }                        
                      }

                      // normal turning
                      else  {
                        normalcurrcnt++;
                        if(normalcurrcnt > TIMEOUT_NORMALCURRENT) {
                          #ifdef motDebug          
                            COMM_DBG.println("M: normal turning timeout");            
                          #endif
                          motor_halt();
                          normalcurrcnt = 0;
                          motorstate = M_IDLE;
                          result = M_RES_ERROR;
                        }                
                      }
                    
                      // output position and current
                        #ifdef motDebugPosAndCurrent
                          COMM_DBG.print("tm;"); 
                          COMM_DBG.print(current_mA,10); 
                          COMM_DBG.print(";"); 
                          COMM_DBG.println(isr_counter);
                        #endif
                    }

                    if (debouncecnt > 50 && cyclecnt > 50) {
                      cyclecnt=0;
                      #ifdef motDebug
                        COMM_DBG.print("M: Current: "); COMM_DBG.print(current_mA/10, 10); COMM_DBG.println(" mA");
                      #endif
                      meancurrent_mem += current_mA;
                      meancurrent_cnt++;
                    }
                    break;
                      
      case M_STOP:         
                    #ifdef motDebug
                      COMM_DBG.println("M: state stop");    
                    #endif                                  
                    motor_halt();
                    #ifdef motDebug
                      COMM_DBG.print("M: Cnt: ");  
                      COMM_DBG.println(isr_counter, DEC);                                 
                    #endif
                    motorstate = M_IDLE;
                    result = M_RES_STOP;                  
                    
                    break;

      case M_UNDERCURR:         
                    motor_halt();
                    #ifdef motDebug
                      COMM_DBG.println("M: state undercurrent detected (M_UNDERCURR), stopped");    
                    #endif                                  
                    motorstate = M_IDLE;
                    result = M_RES_NOCURRENT;                  
                    
                    break;

      case M_TESTPREP:
                    #ifdef motDebug
                      COMM_DBG.println("M: test prep");                                  
                    #endif
                    set_motor(mvalvenr, DIR_OPEN); 
                    settlecnt = MUX_SETTLE_TICKS;
                    settle_next = M_TESTSTART;
                    settle_result = M_RES_TEST;
                    motorstate = M_SETTLE;
                    result = M_RES_TEST;
                    break;

      case M_TESTSTART:
                    isr_overcurrentevent = 0;     // may be left over from the previous move
                    ena_motor(mvalvenr, 1);                 
                
                    cyclecnt = 0;
                    undercurrcnt = 0;
                    normalcurrcnt = 0;
                    overcurrcnt=0;
                    debouncecnt = 0;

                    analog_current_old = 0;
                    analog_current = 0;

                    motorstate = M_TEST;
                    result = M_RES_TEST;                    

                    break;

      case M_TEST:
                    #ifdef motDebug
                      COMM_DBG.print("M: testing"); 
                    #endif
                    result = M_RES_TEST;
                    // calc current in 1/10 mA
                    #ifdef motDebug
                      COMM_DBG.print(" - current: ");
                      COMM_DBG.println (analog_current,DEC);
                    #endif
                    if(debouncecnt<255) debouncecnt++;

                    if(debouncecnt>7) {

                      // under current detection
                      if(analog_current < THRESHOLD_UNDERCURRENT && analog_current > -THRESHOLD_UNDERCURRENT) 
                      {
                        undercurrcnt++;
                        if (undercurrcnt > TIMEOUT_UNDERCURRENTTEST)
                        {
                          #ifdef motDebug
                            COMM_DBG.println("test: (M_TEST) undercurrent!");
                          #endif
                          undercurrcnt = 0;
                          motorstate = M_IDLE;
                          result = M_RES_NOCURRENT;
                          ena_motor(0, 0);
                        }                        
                      }

                      // overcurrent detection
                      else if(isr_overcurrentevent)                              
                      {
                        isr_overcurrentevent = 0;
                        #ifdef motDebug
                          COMM_DBG.println("test: overcurrent!");
                        #endif
                        motorstate = M_IDLE;
                        result = M_RES_ENDSTOP;
                        ena_motor(0, 0);
                      }

                      // normal turning
                      else  {
                        normalcurrcnt++;
                        if(normalcurrcnt > 5) {
                          #ifdef motDebug          
                            COMM_DBG.println("test: normal turning!");            
                          #endif
                          motorstate = M_IDLE;
                          result = M_RES_OPENS;
                          ena_motor(0, 0);      
                        }                
                      }
                    }

                    break;
                    
      default:      motorstate = M_IDLE;
                    result = M_RES_IDLE;
                    break;
    }  

  return result;
}


// sets direction and mux relay
// the relay needs WAIT_MUX ms to settle before the motor is enabled, motorcycle() waits in M_SETTLE
void set_motor (int smvalvenr, int dir) {

  if (smvalvenr % 2) { MUX_OFF(); }
  else { MUX_ON(); }
  
  if (dir == DIR_OPEN) { DIR_OFF(); } 
  else { DIR_ON(); }
}


// enables motor 
void ena_motor (int emvalvenr, int state) {

  if (state == 0) { 
    ENA0_OFF(); ENA1_OFF(); ENA2_OFF(); ENA3_OFF(); ENA4_OFF(); ENA5_OFF(); 
  }
  else {
    if (emvalvenr == 0 || emvalvenr == 1) { ENA0_ON(); }
    else if (emvalvenr == 2 || emvalvenr == 3) { ENA1_ON(); }
    else if (emvalvenr == 4 || emvalvenr == 5) { ENA2_ON(); }
    else if (emvalvenr == 6 || emvalvenr == 7) { ENA3_ON(); }
    else if (emvalvenr == 8 || emvalvenr == 9) { ENA4_ON(); }
    else if (emvalvenr == 10 || emvalvenr == 11) { ENA5_ON(); }
  }
}


