hubertciebiada/VdMot_Controller/software_stm32/src/motor.cpp
void isr_count () {
  if (isr_turning) isr_counter++;
  if (isr_target > 0) isr_target--;
  else callback_motorstop();
}


// switches the motor off and cancels a soft start that TimerHandler0 has not done yet;
// called by the motor state machine (TIM2)
static void motor_halt () {
  detachInterrupt(digitalPinToInterrupt(REVINPIN));
  isr_turning = 0;
  isr_timer_go = 0;       // before fin: TimerHandler0 enables the motor on go && !fin
  isr_timer_fin = 0;
  ena_motor(0, 0);
}


// call from isr to stop motor immediately
// the state machine picks the stop up on its next run (TIM2), it is not reentrant
void callback_motorstop () {
  detachInterrupt(digitalPinToInterrupt(REVINPIN));
  isr_turning = 0;
  ena_motor(0, 0);  
  isr_stop_request = 1;
}


// returns state of application  state machine
enum ASTATE valve_getstate () {
  return valvestate;
}


int16_t appsetaction(char cmd, unsigned int valveindex, byte posdelta, bool force) {
  bool accepted = false;

  if (valveindex < ACTUATOR_COUNT) {
    // valve_loop (TIM2) must see valve, position and command as one consistent set
    const uint32_t primask = __get_PRIMASK();
    __disable_irq();
    // a command accepted earlier but not yet taken by valve_loop must not be overwritten
    if ((valvestate == A_IDLE && command == '\0') || force) {
      valvenr = (int) valveindex;
      poschangecmd = posdelta;
      command = cmd;              // last: valve_loop acts on the command
      accepted = true;
    }
    __set_PRIMASK(primask);
  }

  if (accepted) return 0;
  else {
    #ifdef motDebug          
      COMM_DBG.print("command rejected, state: ");
      COMM_DBG.println(valvestate, DEC);            
    #endif
    return -1;
  }
}


void TimerHandler0()        // called every 1 ms
{
  int analog_value;                     // current valve motor in 1/10 mA read by analog pin

  static int debouncecnt = 0;           // to ignore motor inrush current
  static int overcnt = 0;

  // current measurement
  analog_value = (int) ((( (int32_t) analogRead(ANINCURRENT) - (int32_t) analogRead(ANINREFHALF)) * ANINCURRENTGAIN) / 100);

  // filter test mode
  analog_current = (int) (((int32_t) analog_current_old * 9800 + (int32_t) analog_value * 200) / 10000);
  analog_current_old = analog_current;

  if(isr_turning) {
    //current_mA = analog_current;          // only update when turning, otherwise slower handling will read odd values
    if (debouncecnt < 255) debouncecnt++;

    // filter normal mode
    if(debouncecnt > 250) {
      current_mA = (int) (((int32_t) current_mA_old * 9800 + (int32_t) analog_value * 200) / 10000);
      current_mA_old = current_mA;
    }

    if (current_mA > 600 || current_mA < -600) if(overcnt<255) overcnt++;

    // overcurrent detection
    if(current_mA > 1000 || current_mA < -1000 ||     // safety mechanismn
      overcnt > 10 ||
      (debouncecnt > 250 && (current_mA > currentbound_high || current_mA < currentbound_low)))
    {
      // stop motor immediately
      detachInterrupt(digitalPinToInterrupt(REVINPIN));                           
      ena_motor(0, 0);
      isr_turning = 0;
      isr_overcurrentevent = 1;
    }
  }
  else {
    overcnt = 0;
    debouncecnt = 0;
    current_mA = 0;
    current_mA_old = 0;
  } 

  // ENA valve (soft start requested by M_TURNON and not cancelled since)
  if(isr_turning && isr_timer_go && !isr_timer_fin) {
    isr_timer_fin = 1;
    ena_motor(isr_valvenr, 1);
  }
}
